InformationRegisters/НастройкиУчетаНДСПриУСНКомитентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаНДСПриУСНКомитентов</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновноеНалогообложение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыНалогообложенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНалогообложенияНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентПоНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоФактическомуИспользованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаНаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаНеОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭкспортСырьевыхТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭкспортНесырьевыхТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОСВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетсяРаспределением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяНДСУПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСДЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияРаботУслугНаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаПоПатенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеверсивноеОбложениеНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяНДССМежценовойРазницы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Космос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяНДСВСтранеЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛьготноеНалогообложениеНДСНаУСН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкиУчетаНДСПриУСНКомитентов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает значения по умолчанию для ресурсов регистра.
// Имена ключей структуры должны строго соответствовать именам ресурсов регистра.
// 
// Возвращаемое значение:
// 	Структура - структура значений ресурсов регистра.
Функция ЗначенияПоУмолчанию() Экспорт
	
	СтруктураЗначений = Новый Структура;
	
	СтруктураЗначений.Вставить("СтавкаНДС", Справочники.СтавкиНДС.БезНДС);
	СтруктураЗначений.Вставить("ОсновноеНалогообложение", Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС);
	
	Возврат СтруктураЗначений;
	
КонецФункции

// Возращает текст запроса по данным регистра.
// 
// Возвращаемое значение:
// 	Строка - Текст запроса.
Функция ТекстЗапросаДействующиеПараметрыНалоговУчетныхПолитик() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Таблица.Период КАК Период,
	|	Таблица.ОсновноеНалогообложение КАК ОсновноеНалогообложение,
	|	Таблица.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР КОГДА Таблица.Период ЕСТЬ NULL ТОГДА
	|		ЛОЖЬ
	|	ИНАЧЕ
	|		ИСТИНА
	|	КОНЕЦ КАК УчетнаяПолитикаСуществует
	|ИЗ
	|	РегистрСведений.НастройкиУчетаНДСПриУСНКомитентов.СрезПоследних(&Период,
	|			Комитент В (&Контрагенты)
	|		) КАК Таблица
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Формирует текстовое описание установленных параметров.
// 
// Параметры:
// 	Комитент - СправочникСсылка.Контрагенты - ссылка на комитента.
// 	ДатаДействия - Дата - период действия настроек.
// 	ДействующиеНастройки - Структура - действующие параметры учетной политики.
// Возвращаемое значение:
//  Строка
Функция ОписаниеДействующихПараметров(Комитент, ДатаДействия = Неопределено, ДействующиеНастройки = Неопределено) Экспорт
	
	СтрокаОписанияНастроек = "";
	
	Если ДействующиеНастройки = Неопределено Тогда
		
		Если ЗначениеЗаполнено(ДатаДействия) Тогда
			ДатаДействия = НачалоМесяца(ДатаДействия);
		КонецЕсли;
		
		ДействующиеНастройки = ПартнерыИКонтрагентыЛокализация.ДействующиеПараметрыНалоговУчетныхПолитикКонтрагентов(
			"НастройкиУчетаНДСПриУСНКомитентов",
			Комитент,
			ДатаДействия,
			Ложь);
			
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДействующиеНастройки) Тогда
		СтрокаОписанияНастроек = НСтр("ru='Не заданы Ставки НДС для УСН.'");
		Возврат СтрокаОписанияНастроек;
	КонецЕсли;

	СтрокаШаблон = "%1." + Символы.ПС;  
	СтрокаШаблонЛьготногоНалогообложения = " %1, %2." + Символы.ПС;
	
	Если Не ЗначениеЗаполнено(ДействующиеНастройки.СтавкаНДС) Тогда
		
		Если ДействующиеНастройки.Период < Дата(2026,1,1) Тогда
			Представление = НСтр("ru='Применяются общие ставки НДС (20%, 10%), применяются все вычеты'");
		Иначе
			Представление = НСтр("ru='Применяются общие ставки НДС (22%, 10%), применяются все вычеты'");
		КонецЕсли;
		
		СтрокаОписанияНастроек = СтрокаОписанияНастроек 
			+ СтрШаблон(СтрокаШаблон, Представление);
			
	ИначеЕсли ДействующиеНастройки.СтавкаНДС = Справочники.СтавкиНДС.БезНДС Тогда
		СтрокаОписанияНастроек = СтрокаОписанияНастроек 
			+ СтрШаблон(СтрокаШаблон, 
				НСтр("ru='Продажа не облагается НДС, в документах выбирается ставка ""Без НДС""'"));
	Иначе 
		СтрокаОписанияНастроек = СтрокаОписанияНастроек 
			+ НСтр("ru='Продажи облагаются НДС по льготной ставке'")
			+ СтрШаблон(СтрокаШаблонЛьготногоНалогообложения, 
				Строка(ДействующиеНастройки.СтавкаНДС),
				НСтр("ru='не применяются вычеты'"));
	КонецЕсли;
	
	Возврат СтрокаОписанияНастроек
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Комитент.Партнер)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
